InformationRegisters/ПротоколыРасчетаПартийИСебестоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПротоколыРасчетаПартийИСебестоимости</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Протокол</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДлительностьРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОрганизаций</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаПартийИСебестоимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БылиОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПротоколыРасчетаПартийИСебестоимости/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Возвращает протокол расчета.
//
// Параметры:
// Идентификатор - Строка -
// Период - Дата -
// ПериодРасчета - Дата -
//
// Возвращаемое значение:
// 	Структура - Описание:
// * Протокол - ТекстовыйДокумент -
// * Заголовок - Строка -
//
Функция ПолучитьТекстПротокола(Идентификатор, Период = Неопределено, ПериодРасчета = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Т.Период
		|ИЗ
		|	РегистрСведений.ПротоколыРасчетаПартийИСебестоимости КАК Т
		|ГДЕ
		|	Т.Идентификатор = &Идентификатор
		|	И &ПериодРасчета В (Т.ПериодРасчета, НЕОПРЕДЕЛЕНО)";
		
		Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
		Запрос.УстановитьПараметр("ПериодРасчета", ПериодРасчета);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() = 0 Тогда
			
			ВызватьИсключение НСтр("ru='Протокола расчета не найден. Возможно протокол был удален.';uk='Протокол розрахунку не знайдений. Можливо протокол був вилучений.'");
			
		КонецЕсли;
		
		Выборка.Следующий();
		
		ПериодЗаписи = Выборка.Период;
		
	Иначе
		ПериодЗаписи = Период;
	КонецЕсли;
	
	// Прочитаем запись протокола
	ЗаписьПротокола = РегистрыСведений.ПротоколыРасчетаПартийИСебестоимости.СоздатьМенеджерЗаписи();
	ЗаписьПротокола.Период		  = ПериодЗаписи;
	ЗаписьПротокола.Идентификатор = Идентификатор;
	
	ЗаписьПротокола.Прочитать();
	
	Если ЗаписьПротокола.Выбран() Тогда
		
		// Получим протокол в формате текстового документа
		Протокол = ЗаписьПротокола.Протокол.Получить();
		
		Если ТипЗнч(Протокол) <> Тип("ТекстовыйДокумент") Тогда
			ВызватьИсключение НСтр("ru='Ошибка получения текста протокола расчета.';uk='Помилка отримання тексту протоколу розрахунку.'");
		КонецЕсли;
		
	Иначе
		
		ВызватьИсключение НСтр("ru='Протокола расчета не найден. Возможно протокол был удален.';uk='Протокол розрахунку не знайдений. Можливо протокол був вилучений.'");
		
	КонецЕсли;
	
	Возврат Протокол;
	
КонецФункции

#КонецОбласти

#КонецЕсли
